ХМНПФ_Общее/Documents/уп_ДополнительноеСоглашение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ДополнительноеСоглашение</Name>
		</Properties>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПараметрыПенсионногоДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПараметрыПенсионногоДоговора</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШаблонДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ШаблоныДоговоров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПенсионныеПравила.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПенсионныеПравила</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Правопреемники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПроводкиСводно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПредоставлятьСоциальныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВсегдаНачислятьЗаПолныйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РассчитыватьОУДПриЗачислении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПроводкиСводноОПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВестиРезервВыплатОПСПоДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВестиРезервВыплатОПСПоТипамСумм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписыватьТипыСуммПропорционально</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДФЛПравопреемниковОПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтрольНомеровДоговоровОПСГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Корректировать51СчетПоВидамДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСклонятьФИОВДокументах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетИДОПСпоПриказуФСФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСписыватьИДРасторженцевОПСПриНачислении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетНачисленияИДПриЗакрытии</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОпределениеКоличестваВыплат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПечататьФИОВЗаявлениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвращатьСредстваУмершихДоВступленияВДействие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МетодРасчетаРазмещенногоПРДляДекларации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтрольНумерацииДоговоров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеОснованияНПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянийПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОснований</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СхемаСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СхемаСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПенсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ВидПенсионногоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ВидПенсионногоСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидПенсионногоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыПенсионныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ВидыПенсионныхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ВидыПенсионныхСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БУС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ДополнительноеСоглашение/Ext/ObjectModule.bsl
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура НПФ_ОбработкаПроведения(Отказ, Режим)
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);

	// Молчанов начало
	Если ВидОперации = Перечисления.уп_ВидыОперацийДополнительноеСоглашениеНПО.ИзменениеВыгодоприобретателей Тогда
		Возврат;	
	КонецЕсли;	
	// Молчанов конец
	
	// Проверка ручной корректировки
	Если уп_ОсновнаяПоставкаСервер.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;
	МассивСообщений = Новый СписокЗначений;
	если НЕ ЗначениеЗаполнено(ПенсионныйДоговор) тогда
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не выбран пенсионный договор",,Заголовок);
		Отказ=Истина;
	конецесли;
	
	Если ИзменитьСхему Тогда
		Если Не ЗначениеЗаполнено(НоваяСхема) Тогда
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не указана новая схема пенсионного договора",,Заголовок);
			Отказ=Истина;
		КонецЕсли;	
	КонецЕсли;
	ДатаНачалаВеденияУчетаПоСхемам = Константы.уп_УчетРезерваНПОвРазрезеСхем.Получить();
	Если ЗначениеЗаполнено(ДатаНачалаВеденияУчетаПоСхемам) И ДатаНачалаВеденияУчетаПоСхемам<=Дата Тогда
		ВестиУчетПоСхемам = Истина;
	Иначе
		ВестиУчетПоСхемам = Ложь;
	КонецЕсли;	
	//Схема = ПенсионныйДоговор.Схема;
	//если Схема=Неопределено тогда
	//	уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("В пенсионном договоре не заполнен пенсионный продукт / схема",,Заголовок);
	//	Отказ=Истина;
	//	Возврат;
	//конецесли;
	//если Схема.Метаданные().Имя = "уп_ПенсионныеПродукты" тогда
	//	если НЕ ЗначениеЗаполнено(Схема.Схема) тогда
	//		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("В пенсионном продукте не заполнена схема (строка №1 правил)",,Заголовок);
	//		Отказ=Истина;
	//		Возврат;
	//	конецесли;
	//	ТекСхема=Схема.Схема.Ссылка;
	//иначеесли Схема.Метаданные().Имя = "уп_ПенсионныеСхемы" тогда
	//	ТекСхема=Схема.Ссылка;
	//конецесли;
	
	Если ИзменитьСхему Тогда
		ТекСхема = НоваяСхема;
		//проверить, что дата допса больше даты договора
		Если КонецДня(Дата)<= КонецДня(ПенсионныйДоговор.ДатаЗаключения) Тогда
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Невозможно изменить схему договора - для этого дата дополнительного соглашения должна быть больше даты договора минимум на день.",,Заголовок);
			Отказ = Истина;
		КонецЕсли;	
		ВерсияПенсионныхПравил = уп_НПОСервер.ПолучитьВерсиюПенсионныхПравилСхемыПоРегистру(Организация, ТекСхема, Дата);
	Иначе
		Значение = РегистрыСведений.уп_ПараметрыПенсионногоДоговора.ПолучитьПоследнее(Дата-1, Новый Структура("ПенсионныйДоговор", ПенсионныйДоговор));
		если Значение<>Неопределено тогда
			ТекСхема = Значение.Схема;
			ВерсияПенсионныхПравил = Значение.ВерсияПенсионныхПравил;
		иначе
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Невозможно определить текущую схему договора",,Заголовок);
			Отказ=Истина;
		конецесли; 
	КонецЕсли;
	
	если (ТекСхема.ТипРезерва = Перечисления.уп_ТипыРезерва.ИПС) 
		и (ПенсионныйДоговор.Вкладчик.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо) тогда
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Для индивидуального пенсионного договора нельзя вводить дополнительные пенсионные счета",,Заголовок);
		Отказ=Истина;
	конецесли;
		
	СрезПенсионныхПравил = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	ВестиУчетПСпоТипамДоговоровЕПС = СрезПенсионныхПравил.ВестиУчетПСпоТипамДоговоровЕПС;
	Если ИзменитьСхему Тогда 
		Значение = РегистрыСведений.уп_ПараметрыПенсионногоДоговора.ПолучитьПоследнее(Дата-1, Новый Структура("ПенсионныйДоговор", ПенсионныйДоговор));   
		Если Значение<>Неопределено тогда
			ПредыдущаяСхема = Значение.Схема;
			ТипДоговораЕПСПоПредСхеме = РегистрыСведений.уп_ПравилаПереходовТиповПенсионныхСчетовДляЕПС.ПолучитьПоследнее(Дата, Новый Структура("ПенсионнаяСхема, ТипПенсии", ПредыдущаяСхема, Перечисления.уп_ТипыПенсионныхСхем.ПустаяСсылка())).ТипДоговораЕПС;
		Иначе
			ТипДоговораЕПСПоПредСхеме = Неопределено;
		КонецЕсли;	
		#Удаление
		ТипДоговораЕПСПоСхеме = РегистрыСведений.уп_ПравилаПереходовТиповПенсионныхСчетовДляЕПС.ПолучитьПоследнее(Дата, Новый Структура("ПенсионнаяСхема, ТипПенсии", НоваяСхема, Перечисления.уп_ТипыПенсионныхСхем.ПустаяСсылка())).ТипДоговораЕПС;
		#КонецУдаления
		#Вставка
		ТипДоговраЕПСПоСхеме = РегистрыСведений.уп_ПравилаПереходовТиповПенсионныхСчетовДляЕПС.ПолучитьПоследнее(Дата, Новый Структура("ПенсионнаяСхема", НоваяСхема)).ТипДоговораЕПС;
		#КонецВставки
	Иначе
		#Удаление
		ТипДоговораЕПСПоСхеме = РегистрыСведений.уп_ПравилаПереходовТиповПенсионныхСчетовДляЕПС.ПолучитьПоследнее(Дата, Новый Структура("ПенсионнаяСхема, ТипПенсии", ТекСхема, Перечисления.уп_ТипыПенсионныхСхем.ПустаяСсылка())).ТипДоговораЕПС;
		#КонецУдаления
		#Вставка
		ТипДоговораЕПСПоСхеме = РегистрыСведений.уп_ПравилаПереходовТиповПенсионныхСчетовДляЕПС.ПолучитьПоследнее(Дата, Новый Структура("ПенсионнаяСхема", ТекСхема)).ТипДоговораЕПС;
		#КонецВставки
	КонецЕсли;
		
	// НАЧАЛО 22.10.2017 golnev@orticongroup.ru npo
	Если ВидОперации = Перечисления.уп_ВидыОперацийДополнительноеСоглашениеНПО.ИзменениеУсловийДоговора Тогда
		Если ИзменитьСхему Тогда
			Если Не ЗначениеЗаполнено(НоваяСхема) Тогда
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не указана новая схема пенсионного договора",,Заголовок);
				Отказ=Истина;
			Иначе
				ЗаменаПенсионнойСхемы(Отказ, ВерсияПенсионныхПравил);
				
				Если ТипДоговораЕПСПоСхеме<>ТипДоговораЕПСПоПредСхеме И НЕ ВестиУчетПСпоТипамДоговоровЕПС Тогда
					Движение = Движения.уп_ДопСведенияДляТрансляции.Добавить();
					Движение.Период = ДатаНачалаДействия;
					Движение.Объект = ПенсионныйДоговор; 
					Движение.Свойство = ПланыВидовХарактеристик.уп_ДополнительныеСведенияСРегистратором.ТипДоговораНПО_ЕПС;
					Движение.Значение = ТипДоговораЕПСПоСхеме; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ИзменитьШаблон Тогда
			Если Не ЗначениеЗаполнено(ШаблонДоговора) Тогда
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не указан шаблон договора",,Заголовок);
				Отказ=Истина;
			Иначе	
				Если НЕ ИзменитьСхему Тогда
					//регистр Параметры договора
					Движение = Движения.уп_ПараметрыПенсионногоДоговора.Добавить();
					Движение.Период = ДатаНачалаДействия;
					Движение.ПенсионныйДоговор = ПенсионныйДоговор;
					Движение.ШаблонДоговора = ШаблонДоговора;
					Движение.Схема = ТекСхема;   
					Движение.ВерсияПенсионныхПравил = ВерсияПенсионныхПравил;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		Если ИзменитьСтратегию Тогда
			Если ЗначениеЗаполнено(ИнвестиционнаяСтратегия) Тогда
				
				//регистр Инвестиционная стратегия
				Движение = Движения.уп_ИнвестиционныеСтратегии.Добавить();
				//Движение.Период = КонецГода(ДатаНачалаДействия) + 1; 
				Движение.Период = ДатаНачалаДействия;
				Движение.ПенсионныйДоговор = ПенсионныйДоговор;
				Движение.ИнвестиционнаяСтратегия = ИнвестиционнаяСтратегия;
			Иначе
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не указана новая Инвестиционная стратегия",,Заголовок);
				Отказ=Истина;
				Возврат;	
			КонецЕсли;
		КонецЕсли;
		
		
	Иначе
		// КОНЕЦ 22.10.2017 golnev@orticongroup.ru
		#Удаление
		Если ВидОперации = Перечисления.уп_ВидыОперацийДополнительноеСоглашениеНПО.ВводНовыхСчетов Тогда
		#КонецУдаления
			//надо выяснить, есть ли уже открытые пенсионные счета (другим документом) по списку участников.
			//если есть, то вывести в протокол и документ не проводить
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	СостоянияПС.НомерСчета.Владелец,
			|	СостоянияПС.НомерСчета.Участник КАК Участник,
			|	СостоянияПС.Регистратор КАК Регистратор,
			|	СостоянияПС.Период КАК Период
			|ИЗ
			|	РегистрСведений.уп_СостоянияПС КАК СостоянияПС
			|ГДЕ
			|	СостоянияПС.НомерСчета.Владелец = &ПенсионныйДоговор
			|	И СостоянияПС.Регистратор <> &ТекДок
			|	И СостоянияПС.НомерСчета.Участник В(&СписокУч)
			|	И СостоянияПС.Период < &ДатаДок
			#Вставка
			//+ХМНПФ 17.12.2020  Хлопцев Б.А. //  № 3027 возможность вводить участнику более одно пенс.счета
			|	И СостоянияПС.НомерСчета.Код В(&СписокНС)
			//-ХМНПФ 17.12.2020  Хлопцев Б.А. //  № 3027 возможность вводить участнику более одно пенс.счета
			#КонецВставки
			|
			|УПОРЯДОЧИТЬ ПО
			|	Участник,
			|	Период
			|ИТОГИ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Регистратор)
			|ПО
			|	Участник";
			
			Запрос.УстановитьПараметр("ПенсионныйДоговор", ПенсионныйДоговор);
			Запрос.УстановитьПараметр("ТекДок", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("СписокУч", СписокУчастников.ВыгрузитьКолонку("ФизЛицо"));
			Запрос.УстановитьПараметр("ДатаДок", ДатаНачалаДействия);
			#Вставка
			//+ХМНПФ 17.12.2020  Хлопцев Б.А. //  № 3027 возможность вводить участнику более одно пенс.счета
			Запрос.УстановитьПараметр("СписокНС", СписокУчастников.ВыгрузитьКолонку("НомерНовогоПС"));
			//-ХМНПФ 17.12.2020  Хлопцев Б.А. //  № 3027 возможность вводить участнику более одно пенс.счета
			#КонецВставки
			
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока Выборка.Следующий() Цикл
				Если Выборка.Регистратор>0 Тогда //есть состояния, введенные до соглашения
					//проверяем, чем зарегистрированы
					ВыборкаРегистраторов = Выборка.Выбрать();
					Пока ВыборкаРегистраторов.Следующий() Цикл
						Если ТипЗнч(ВыборкаРегистраторов.Регистратор) = Тип("ДокументСсылка.уп_ОткрытиеДоговора")
							или ТипЗнч(ВыборкаРегистраторов.Регистратор) = Тип("ДокументСсылка.уп_ДополнительноеСоглашение")  Тогда
							Отказ = Истина;
							Сообщить("Для участника "+ВыборкаРегистраторов.Участник+", код "+ВыборкаРегистраторов.Участник.Код+" пенсионный счет зарегистрирован документом "+ВыборкаРегистраторов.Регистратор, СтатусСообщения.Важное);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			
			Если Отказ Тогда
				Возврат
			КонецЕсли;
			#Удаление
			Конецесли;
			#КонецУдаления
		
		Если ИзменитьСхему Тогда
			//регистр СхемаСчета
			Движение = Движения.уп_ПараметрыПенсионногоДоговора.Добавить();
			Движение.Период = ДатаНачалаДействия;
			Движение.ПенсионныйДоговор = ПенсионныйДоговор;
			Движение.Схема = ТекСхема; 
			Движение.ВерсияПенсионныхПравил = ВерсияПенсионныхПравил;
			
			//и схему счета договора
			Движение = Движения.уп_СхемаСчета.Добавить();
			Движение.Период = ДатаНачалаДействия;
			Движение.НомерСчета = ПенсионныйДоговор.ПенсионныйСчет;
			Движение.Схема = ТекСхема;
			Движение.ВерсияПенсионныхПравил = ВерсияПенсионныхПравил;
			
			Если ВестиУчетПСпоТипамДоговоровЕПС Тогда
				Движение = Движения.уп_ТипыПенсионныхСчетовДляЕПС.Добавить();
				Движение.Период = ДатаНачалаДействия;
				Движение.НомерСчета = ПенсионныйДоговор.ПенсионныйСчет;
				Движение.ТипДоговораЕПС = ТипДоговораЕПСПоСхеме; 
				
				Движение = Движения.уп_ДопСведенияДляТрансляции.Добавить();
				Движение.Период = ДатаНачалаДействия;
				Движение.Объект = ПенсионныйДоговор.ПенсионныйСчет; 
				Движение.Свойство = ПланыВидовХарактеристик.уп_ДополнительныеСведенияСРегистратором.ТипДоговораНПО_ЕПС;
				Движение.Значение = ТипДоговораЕПСПоСхеме;   
			Иначе
				Движение = Движения.уп_ДопСведенияДляТрансляции.Добавить();
				Движение.Период = ДатаНачалаДействия;
				Движение.Объект = ПенсионныйДоговор; 
				Движение.Свойство = ПланыВидовХарактеристик.уп_ДополнительныеСведенияСРегистратором.ТипДоговораНПО_ЕПС;
				Движение.Значение = ТипДоговораЕПСПоСхеме;   
			КонецЕсли;	
		КонецЕсли;
		
		#Удаление
		НастройкиПараметровУчета = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
		ПорядокНумерацииПС =  НастройкиПараметровУчета.ПорядокНумерацииПС;
		ПрефиксНумерацииПС =  НастройкиПараметровУчета.ПрефиксНумерацииПС;
		#КонецУдаления
		
		для каждого СТР из СписокУчастников цикл
			
			//сначал надо проверить не существует ли уже пенсионный счет у данного участника под этим договором
			#Удаление
			Если ВидОперации = Перечисления.уп_ВидыОперацийДополнительноеСоглашениеНПО.ВводНовыхСчетов И ПорядокНумерацииПС = 0  Тогда
				СТР.ПенсионныйСчет = ПроверитьНаличиеПС(СТР.ФизЛицо);
			КонецЕсли;
			#КонецУдаления
			#Вставка
 			//+ХМНПФ 17.12.2020  Хлопцев Б.А. //  № 3027 возможность вводить участнику более одно пенс.счета
			СТР.ПенсионныйСчет = НПФ_ПроверитьНаличиеПС(СТР.ФизЛицо,СТР.НомерНовогоПС);
			//-ХМНПФ 17.12.2020  Хлопцев Б.А. //  № 3027 возможность вводить участнику более одно пенс.счета
			#КонецВставки
			
			если НЕ ЗначениеЗаполнено(СТР.ПенсионныйСчет) тогда
				Счет = Справочники.уп_ПенсионныеСчета.СоздатьЭлемент();
				#Удаление
				Если ПорядокНумерацииПС = 0 Тогда
				#КонецУдаления
					Счет.Код = СокрЛП(СТР.НомерНовогоПС);
				#Удаление
				Иначе
					Счет.УстановитьНовыйКод(ПрефиксНумерацииПС);
					стр.НомерНовогоПС = Счет.Код;
				КонецЕсли;	
				#КонецУдаления
				Счет.Наименование = СокрЛП(СТР.ФизЛицо.Наименование);
				Счет.Участник = СТР.ФизЛицо;
				Счет.Владелец = ПенсионныйДоговор;
				Счет.ТипПенсионногоСчета = Перечисления.уп_ТипыПенсионныхСчетов.ПенсионныйСчетУчастника;
				////ИФРС17
				//Если НадоЗаполнятьГруппуИФРС17ПС Тогда
				//	Счет.ИФРС17_ГруппаДоговоровНПО = ГруппаДоговоров;
				//КонецЕсли;	
				////~ИФРС17
				Счет.Записать();
				СТР.ПенсионныйСчет = Счет.Ссылка;
			иначе
				если (СТР.ПенсионныйСчет.Участник <> СТР.ФизЛицо)
					или (СокрЛП(СТР.ПенсионныйСчет.Код)<>СокрЛП(СТР.НомерНовогоПС))тогда
					Счет = СТР.ПенсионныйСчет.ПолучитьОбъект();
					Счет.Код = СокрЛП(СТР.НомерНовогоПС);
					Счет.Наименование = СокрЛП(СТР.ФизЛицо.Наименование);
					Счет.Участник = СТР.ФизЛицо;
					Счет.ТипПенсионногоСчета = Перечисления.уп_ТипыПенсионныхСчетов.ПенсионныйСчетУчастника;
					////ИФРС17
					//Если НадоЗаполнятьГруппуИФРС17ПС Тогда
					//	Счет.ИФРС17_ГруппаДоговоровНПО = ГруппаДоговоров;
					//КонецЕсли;	
					////~ИФРС17
					Счет.Записать();
				Иначе
					Счет = СТР.ПенсионныйСчет.ПолучитьОбъект();
				конецесли;
			конецесли;
			Счет.УстановитьПометкуУдаления(Ложь, Ложь);
			
		конеццикла;
		
		ЭтотОбъект.Записать();
		
		Для Каждого СТР Из СписокУчастников Цикл
			// регистр СостоянияПС 
			Движение = Движения.уп_СостоянияПС.Добавить();
			Движение.Период = ДатаНачалаДействия;
			Движение.НомерСчета = СТР.ПенсионныйСчет;
			если ОткрыватьСчетаПриПоступленииВзносов тогда
				Движение.Состояние = Перечисления.уп_СостоянияПС.ОжиданиеВзносов;
			иначе
				Движение.Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод;
			конецесли;	
			//регистр ВидПенсионногоСчета
			Движение = Движения.уп_ВидПенсионногоСчета.Добавить();
			Движение.Период = ДатаНачалаДействия;
			Движение.НомерСчета = СТР.ПенсионныйСчет;
			Если ТекСхема.ТипРезерва = Перечисления.уп_ФормаРезерваНПО.ИПС Тогда
				Движение.ВидПенсионногоСчета = Перечисления.уп_ВидыПенсионныхСчетов.ИПС;
			Иначе
				Движение.ВидПенсионногоСчета = ВидПенсионногоСчета;
			КонецЕсли;
			//регистр СхемаСчета                                         
			Движение = Движения.уп_СхемаСчета.Добавить();
			Движение.Период = ДатаНачалаДействия;
			Движение.НомерСчета = СТР.ПенсионныйСчет;
			Движение.Схема = ТекСхема;  
			Движение.ВерсияПенсионныхПравил = ВерсияПенсионныхПравил;
			
			Если ВестиУчетПСпоТипамДоговоровЕПС Тогда
				Движение = Движения.уп_ТипыПенсионныхСчетовДляЕПС.Добавить();
				Движение.Период = ДатаНачалаДействия;
				Движение.НомерСчета = СТР.ПенсионныйСчет;
				Движение.ТипДоговораЕПС = ТипДоговораЕПСПоСхеме;
				
				Движение = Движения.уп_ДопСведенияДляТрансляции.Добавить();
				Движение.Период = ДатаНачалаДействия;
				Движение.Объект = СТР.ПенсионныйСчет; 
				Движение.Свойство = ПланыВидовХарактеристик.уп_ДополнительныеСведенияСРегистратором.ТипДоговораНПО_ЕПС;
				Движение.Значение = ТипДоговораЕПСПоСхеме;
			КонецЕсли;	
			
			//место работы
			Движение = Движения.уп_МестаРаботыУчастников.Добавить();
			Движение.Период = ДатаНачалаДействия;
			Движение.Участник = Стр.ФизЛицо;
			Движение.МестоРаботы = ПенсионныйДоговор.Вкладчик;
		КонецЦикла;
		
		Для каждого СтрГрафикаПлатежей из ГрафикПлатежей Цикл
			Движение = Движения.уп_ГрафикПлатежейНПО.Добавить();
			Движение.Период = Дата;
			Движение.Дата = СтрГрафикаПлатежей.Дата;
			Движение.Сумма = СтрГрафикаПлатежей.Сумма;
			Движение.ПериодПлатежей = СтрГрафикаПлатежей.Периодичность;
			Движение.КоличествоПлатежей = СтрГрафикаПлатежей.КоличествоПлатежей;
			Движение.ПенсионныйДоговор = ПенсионныйДоговор;
			Движение.ЛимитДней = СтрГрафикаПлатежей.ЛимитДней;
			Движение.Комментарий = СтрГрафикаПлатежей.Комментарий;
		КонецЦикла;	
		
		// НАЧАЛО 22.10.2017 golnev@orticongroup.ru npo
	КонецЕсли;
	// КОНЕЦ 22.10.2017 golnev@orticongroup.ru
	ДополнительныеСвойства.Вставить("МассивСообщений", МассивСообщений);
	// записываем движения регистров
	Движения.уп_СостоянияПС.Записать();
	Движения.уп_ВидПенсионногоСчета.Записать();
	Движения.уп_СхемаСчета.Записать();
	Движения.уп_МестаРаботыУчастников.Записать();
	Движения.уп_ГрафикПлатежейНПО.Записать();
	Движения.уп_ТипыПенсионныхСчетовДляЕПС.Записать();
	#Вставка
	//Запись в регистр ХМ_ДПОСчетаЮЛ. Попов С.О.
	Если ХМ_ДПОДоговорФЛ <> Справочники.уп_ПенсионныеДоговоры.ПустаяСсылка() Тогда
		Движения.ХМ_ДПОСчетаЮЛ.Записывать = Истина;
		ЗаписьВРегистр = Движения.ХМ_ДПОСчетаЮЛ.Добавить();
		ЗаписьВРегистр.Регистратор = Ссылка;
		ЗаписьВРегистр.Период = Дата;
		ЗаписьВРегистр.Активность = Истина;
		ЗаписьВРегистр.ПенсионныйДоговор = ХМ_ДПОДоговорФЛ;
		ЗаписьВРегистр.ПенсионныйСчетЮЛ = СписокУчастников[0].ПенсионныйСчет; 
		Движения.ХМ_ДПОСчетаЮЛ.Записать();
	КонецЕсли;
	//ХМ_ДПОСчетаЮЛ. Попов С.О.
	#КонецВставки
КонецПроцедуры

//+ХМНПФ 17.12.2020  Хлопцев Б.А. //  № 3027 возможность вводить участнику более одно пенс.счета
Функция НПФ_ПроверитьНаличиеПС(Участник,Код)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_ПенсионныеСчета.Ссылка КАК Ссылка,
	|	уп_ПенсионныеСчета.Код КАК Код
	|ИЗ
	|	Справочник.уп_ПенсионныеСчета КАК уп_ПенсионныеСчета
	|ГДЕ
	|	уп_ПенсионныеСчета.Владелец = &Владелец
	|	И уп_ПенсионныеСчета.Участник = &Участник
	|	И уп_ПенсионныеСчета.Код = &Код";
	
	Запрос.УстановитьПараметр("Владелец", ПенсионныйДоговор);
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Участник", Участник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ССылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
//-ХМНПФ 17.12.2020  Хлопцев Б.А. //  № 3027 возможность вводить участнику более одно пенс.счета

// ХМНПФ 03.11.2016 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №631
Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ, СтруктураТЧ) Экспорт
	Если Проведен Тогда
	#Если Сервер Тогда
		Для каждого стр Из СтруктураТЧ.СписокУчастников.ТЗ Цикл
			ОбъектПС = стр.ПенсионныйСчет.ПолучитьОбъект();
			ОбъектПС.Владелец = СтрокаТЗ.ПенсионныйДоговор;
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(ОбъектПС);
		КонецЦикла;
		ОбработкаПроведения(Отказ, Режим);
		Документы.уп_ДополнительноеСоглашение.уп_ДополнительноеСоглашение(ЭтотОбъект, Отказ, Режим);
	#КонецЕсли
	КонецЕсли;
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 02.11.2016 ШадринАВ // длина номера изменена с 8 до 27 // №459
	// ХМНПФ 03.11.2016 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №631
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура ХМОбработкаПроведения(Отказ, Режим)
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли; 
	
	Документы.уп_ДополнительноеСоглашение.уп_ДополнительноеСоглашение(ЭтотОбъект, Отказ, Режим);

КонецПроцедуры
